# Assignment:
Consider the following "flat" file that a start-up has just started using for its first customers: [Client's Original File](https://docs.google.com/spreadsheets/d/1uVH2ETvkVxQecG7N4jnbprVnTTlmuZfmY6jQVFkv9V0/gviz/tq?tqx=out:csv&sheet=Customers_favorite_books). They quickly realized that saving this information in .csv format will not meet their needs as they grow. First, consider how you would design a relational database to meet their needs. Be sure to consider conventions of normalization and what information should be separated.

# Part 1: Design an ERD
Create an ERD (figure out how many tables to include and the relationships between them) to represent a database that tracks users and their favorite books. Here are some considerations as you design the database:

- For the purposes of this assignment, you may assume that each book only has one author (or that we are only tracking the primary author), but that the same author may have written multiple books.
- Each user should have a first name, last name, and email.
- We will be saving a list of each user's favorite books.
- Each book should have a title and an author. (The author's whole name can be one attribute)
- Note that each user will have multiple favorite books, and a book could certainly be the favorite of many users.
- Use the MySQL Workbench for designing the ERD.
- Hint: When you link two tables with a many to many relationship, MySQL Workbench will automatically create a joiner table for you! It will also automatically make the keys primary keys, which you will want to uncheck.
Insert the image of your ERD into the first markdown cell of your Jupyter Notebook. Use the example markdown syntax for inserting an image.

 `![png](image_filename.png)copy`

# Part 2: Create the database in Python
Continue working in Jupyter Notebook with the ERD image.

Rather than creating the database in MySQL workbench with forward engineering, we are going to develop our Python skills by creating the database in Python using PyMySQL that you practiced in the "MySQL with Python" lesson.

Note that working with MySQL via Python will be a required component of the belt exam, so getting comfortable with it now will help prepare you!

You will need to create a connection. This time, you may wish to call it "books"

`# Create connection string using credentials following this format`

`# connection = "dialect+driver://username:password@host:port/database" `

`connection = "mysql+pymysql://root:root@localhost/books"copy`

Normally, you would have to take the time to transform the original .csv file from your client into the appropriate normalized tables. However, for this task, the transformation steps have been completed for you and you are provided a .csv for each table you will need. (Note that you will be learning and practicing efficient ways to make these transformations next week!)

The four files you will need to add as tables to your database are:

[users](https://docs.google.com/spreadsheets/d/1_c2WTx_eiH8pUM-PTgyt7T4aIl1A3Cp1ukPVPEijoYc/gviz/tq?tqx=out:csv&sheet=users)

[books](https://docs.google.com/spreadsheets/d/1_D-vW7GXiQfG6D9nzjscgVctKLb6TZl_o8ERNH_tet8/gviz/tq?tqx=out:csv&sheet=books)

[authors](https://docs.google.com/spreadsheets/d/17rABPt5eaIxfhGO75dYCbH-5IloKsAR0HH9V6VC43ZI/gviz/tq?tqx=out:csv&sheet=authors)

[favorites](https://docs.google.com/spreadsheets/d/1SLb3RAhcrZsPWRwR0_njWX7KssUYZ16JFsVqBkSU2GI/gviz/tq?tqx=out:csv&sheet=favorite)

Note that these files may not perfectly match the schema you designed. Notice how they are different, but move forward with these tables even if they are not exactly the same as your original plan. (Notably, we will not have created_at and updated_at attributes)

Once you have added these tables to your database, the database is now available to query from MySQL workbench OR in your Jupyter Notebook using SQLAlchemy!

# Testing the Database
After creating your 4 tables, you should run the "SHOW TABLES;" query in your notebook.

As a final step to this task, write a query at the end of your Jupyter Notebook to list the titles of all of John Doe's favorite books. An example of the SQL syntax: Note this will depend on how you named your tables.

`SELECT books.title, favorites.user_id`

`FROM books`

`JOIN favorites` 

`ON books.id = favorites.book_id`

`WHERE favorites.user_id =`

`(SELECT users.id FROM users `

`WHERE (users.last_name = "Doe" AND`

`users.first_name = "John"));`

# Part 3: Exporting the database and committing to GitHub
Now that you've created your database and verified it works, open MySQL Workbench and use the Export Database tool to save the .SQL file for your database in your assignment repository.

Add both of these files to your GitHub repository:

- Jupyter Notebook (including the ERD from Part 1 and code for Part 2)
- Exported .sql file.

# ERD Model

![png](Books ERD Model.png)
![](image.png)

# Imports

In [1]:
import pymysql
import pandas as pd
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

In [2]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = quote_plus("CeyRaySon12#") # (or whatever password you chose during mysql installation)
db_name = "books"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [3]:
# create engine
engine = create_engine(connection)

In [4]:
# create new database if doesn't exist
if database_exists(connection) == False:
    create_database(connection)
    print('Database created.')
else:
    print("The database already exists.")

The database already exists.

# Add Tables to SQL

## Users Table

In [5]:
# read in csv file
users = pd.read_csv('Data/users.csv')

# check
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [6]:
# add table to sql
users.to_sql('users', engine, if_exists = 'replace')

3

In [7]:
# check with query
q = """
SHOW TABLES;
"""

pd.read_sql(q, engine)

  Tables_in_books
0           books
1           users

## Books Table

In [8]:
# read in csv file
books = pd.read_csv('Data/books.csv')

# check
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [9]:
# add tables to sql
books.to_sql('books', engine, if_exists = 'replace')

6

In [10]:
# check with query
q = """
SHOW TABLES;
"""

pd.read_sql(q, engine)

  Tables_in_books
0           books
1           users

## Authors Table

In [11]:
# read in csv file
authors = pd.read_csv('Data/authors.csv')

# check
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [12]:
# add tables to sql
authors.to_sql('authors', engine, if_exists = 'replace')

5

In [13]:
# check with query
q = """
SHOW TABLES;
"""

pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2           users

## Favorites Table

In [14]:
# read in csv file
favorites = pd.read_csv('Data/favorites.csv')

# check
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

In [15]:
# add tables to sql
favorites.to_sql('favorites', engine, if_exists = 'replace')

7

In [16]:
# check with query
q = """
SHOW TABLES;
"""

pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

In [17]:
q = '''
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users 
    WHERE (users.last_name = "Doe" AND users.first_name = "John"));
'''

pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1